Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: This is similar to how the `"flex-grow" <https://developer.mozilla.org/en-US/docs/Web/CSS/flex-grow>`__ property works in CSS.
it_it: Questo è simile al funzionamento della proprietà `"flex-grow" <https://developer.mozilla.org/en-US/docs/Web/CSS/flex-grow>`__ in CSS.

source: This is the SDK!
it_it: Questo è l'SDK!

source: This is the method documented here.
it_it: Questo è il metodo documentato qui.

source: This is the opposite of event bubbling --- instead of propagating up the parent, events propagate down to the children.
it_it: Questo è l'opposto del "bubbling" degli eventi: invece di propagarsi verso l'alto, gli eventi si propagano verso il basso fino ai widget figli.

source: This is the path of lvgl recipes: ``lvgl_yocto_guide/sources/meta-openembedded/ meta-oe/recipes-graphics/lvgl``
it_it: Questo è il path delle ricette lvgl: ``lvgl_yocto_guide/sources/meta-openembedded/ meta-oe/recipes-graphics/lvgl``

source: This is true whether you are using the provided Y-value array or provided your own.
it_it: Questo vale sia che si utilizzi l'array di valori Y fornito sia che se ne fornisca uno proprio.

source: This is useful for checking your application for memory leaks and other bugs.
it_it: Questo è utile per verificare la presenza di "memory leak" [perdite di memoria] e altri bug nell'applicazione.

source: This is useful for verifying responsive designs.
it_it: Questo è utile per verificare i design "responsive".

source: This is useful if you want the message box to close the on the next call to ``lv_timer_handler`` instead of immediately.
it_it: Questo è utile se si desidera che la finestra di messaggio si chiuda alla successiva chiamata a ``lv_timer_handler`` anziché immediatamente.

source: This is useful to check if events (e.g., long press, long press repeat) and timers were triggered correctly over time.
it_it: Questo è utile per verificare se gli eventi (ad esempio, pressione prolungata, ripetizione pressione prolungata) e i timer sono stati attivati correttamente nel tempo.

source: This is useful to place the cursor on that data point.
it_it: Questo è utile per posizionare il cursore su quel punto dati.

source: This is useful when you want to ignore the hierarchy and search by name alone.
it_it: Questo è utile quando si desidera ignorare la gerarchia e cercare solo per nome.

source: This is useful, for example, if you want to delete the parent of a widget in the child's :cpp:enumerator:`LV_EVENT_DELETE` handler.
it_it: Questo è utile, ad esempio, se si desidera eliminare l'elemento padre di un widget nel gestore :cpp:enumerator:`LV_EVENT_DELETE` del widget figlio.

source: This is useful, for example, to simplify navigation among items in a :ref:`List Widget <lv_list>`.
it_it: Questo è utile, ad esempio, per semplificare la navigazione tra gli elementi in una :ref:`Lista di Widget <lv_list>`.

source: This is what happens under the hood:
it_it: Ecco cosa succede dietro le quinte:

source: This is where you make |lvglpro| do valuable work for you, building your UI or Component Library.
it_it: È qui che |lvglpro| svolge il suo prezioso lavoro, creando l'interfaccia utente o la Libreria di Componenti.

source: This is where you'll look when a build fails to figure out what went wrong.
it_it: È qui che si andrà a cercare quando una build non riesce a capire cosa è andato storto.

source: This issue often occurs with HDMI connections where the display is powered up after the system has already booted.
it_it: Questo problema si verifica spesso con le connessioni HDMI in cui il display viene acceso dopo che il sistema si è già avviato.

source: This iterates through all characters, calculates their positions, and calls the callback for rendering each character.
it_it: Questa itera su tutti i caratteri, calcola le loro posizioni e richiama la callback per il rendering di ciascun carattere.

source: This letter must be unique among all registered file-system drivers, and in the range [A-Z] or the character '/'.
it_it: Questa lettera deve essere univoca tra tutti i driver del file system registrati e compresa nell'intervallo [A-Z] o nel carattere '/'.

source: This library can load videos and images.
it_it: Questa libreria può caricare video e immagini.

source: This license does not grant any rights to use the LVGL name, logo, or trademarks.
it_it: Questa licenza non concede alcun diritto di utilizzo del nome, del logo o dei marchi LVGL.

source: This license only applies to **UI development tools** that **read, generate, or process XML files using this Specification for UI development purposes** in a public or commercial manner.
it_it: Questa licenza si applica solo agli **strumenti di sviluppo dell'interfaccia utente** che **leggono, generano o elaborano file XML utilizzando questa Specifica per scopi di sviluppo dell'interfaccia utente** in modo pubblico o commerciale.

source: This list of functions provides access to the parts shown in diagram above:
it_it: Questo elenco di funzioni fornisce l'accesso alle parti mostrate nel diagramma sopra:

source: This list summarizes the effect of RTL base direction on Widgets:
it_it: Questo elenco riassume l'effetto della direzione di base RTL sui widget:

source: This location defaults to:
it_it: Questa posizione di defaults è:

source: This logic, of course, can be overridden or redefined, depending on system design.
it_it: Questa logica, ovviamente, può essere sovrascritta o ridefinita, a seconda della progettazione del sistema.

source: This macro in ``lv_conf.h`` defaults to whatever value :c:macro:`LV_USE_OBJ_ID` equates to.
it_it: Questa macro in ``lv_conf.h`` assume per default il valore equivalente a :c:macro:`LV_USE_OBJ_ID`.

source: This macro in ``lv_conf.h`` equates to ``1`` by default.
it_it: Questa macro in ``lv_conf.h`` equivale a ``1`` per default.

source: This makes Neon acceleration universally available on all 64-bit ARM platforms, including current and future ARM architectures.
it_it: Questo rende l'accelerazione Neon universalmente disponibile su tutte le piattaforme ARM a 64 bit, comprese le architetture ARM attuali e future.

source: This makes it easy to check whether the widget exists or not.
it_it: Questo semplifica la verifica dell'esistenza o meno del widget.

source: This makes it suitable for production deployments, such as kiosk interfaces, control panels, or other embedded GUIs where Wayland is the display server.
it_it: Questo lo rende adatto per implementazioni di produzione, come interfacce per chioschi, pannelli di controllo o altre GUI embedded in cui Wayland è il server di visualizzazione.

source: This makes it very convenient to apply to the appearance (and other attributes) of UI components.
it_it: Questo lo rende molto comodo da applicare all'aspetto (e ad altri attributi) dei componenti dell'interfaccia utente.

source: This makes the buffer address alignment to be 32 bytes for RGB565 and 64 bytes for ARGB8888.
it_it: Questo fa sì che l'allineamento dell'indirizzo del buffer sia di 32 byte per RGB565 e di 64 byte per ARGB8888.

source: This makes the scale horizontal with tick marks below the line.
it_it: Questo rende la scala orizzontale con le tacche sotto la linea.

source: This makes the space between items double the space between edge items and the container's edge.
it_it: Questo fa sì che lo spazio tra gli elementi sia il doppio dello spazio tra gli elementi sul bordo e il bordo del contenitore.

source: This mapping is implemented in the Widget's XML parser.
it_it: Questa mappatura è implementata nel parser XML del Widget.

source: This maximum can be changed by using :cpp:expr:`lv_tiny_ttf_create_data_ex(data, data_size, font_size, kerning, cache_size)` or :cpp:expr:`lv_tiny_ttf_create_file_ex(path, font_size, kerning, cache_size)` (when available).
it_it: Questo valore massimo può essere modificato utilizzando :cpp:expr:`lv_tiny_ttf_create_data_ex(data, data_size, font_size, kerning, cache_size)` o :cpp:expr:`lv_tiny_ttf_create_file_ex(path, font_size, kerning, cache_size)` (se disponibile).

source: This means all three parts of the slider can have their own styles.
it_it: Ciò significa che tutte e tre le parti dello slider possono avere i propri stili.

source: This means if a property is not set in a Widget it will be searched for in its parents.
it_it: Ciò significa che, se una proprietà non è impostata in un Widget, verrà cercata nei Widget genitore.

source: This means if a property is specified in two styles the newest style in the Widget will be used.
it_it: Ciò significa che, se una proprietà è specificata in due stili, verrà utilizzato lo stile più recente nel widget.

source: This means it will automatically set its size to fit all the points.
it_it: Ciò significa che le sue dimensioni verranno impostate automaticamente in modo da adattarsi a tutti i punti.

source: This means it's enough to set the base direction of a screen and its child Widgets will inherit it.
it_it: Ciò significa che è sufficiente impostare la direzione di base di una schermata e i Widget figli la erediteranno.

source: This means not only the children can make a Widget scrollable but a larger self size will as well.
it_it: Ciò significa che non solo i figli possono rendere scorrevole un Widget, ma anche una "self size" maggiore.

source: This means that Components do not have a detailed set/get API, but are created with a fixed set of parameters.
it_it: Ciò significa che i Componenti non dispongono di un'API set/get dettagliata, ma vengono creati con un set fisso di parametri.

source: This means that gridnav works with manually positioned children, as well as :ref:`flex` and :ref:`grid` layouts.
it_it: Ciò significa che gridnav funziona con i figli posizionati manualmente, così come con i layout :ref:`flex` e :ref:`grid`.

source: This means that in :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, the ``draw_task``\ s and draw descriptors are already initialized and it's enough to change only a few specific values.
it_it: Ciò significa che in :cpp:enumerator:`LV_EVENT_DRAW_TASK_ADDED`, i ``draw_task`` e i descrittori di disegno sono già inizializzati ed è sufficiente modificare solo alcuni valori specifici.

source: This means that the actual values need to be bound to the names when the UI is loaded from XML, otherwise, LVGL will not know what a name means.
it_it: Ciò significa che i valori effettivi devono essere associati ai nomi quando l'interfaccia utente viene caricata da XML, altrimenti LVGL non saprà cosa significa un nome.

source: This means that the bits are packed even across rows, but EVE cannot use fonts that are packed across rows.
it_it: Ciò significa che i bit vengono compressi uniformemente su più righe, ma EVE non può utilizzare font compressi su più righe.

source: This means that the contents of the character buffer *must* remain valid for the life of the label or until another buffer is set via one of the above functions.
it_it: Ciò significa che il contenuto del buffer dei caratteri *deve* rimanere valido per tutta la durata dell'etichetta o finché non viene impostato un altro buffer tramite una delle funzioni sopra indicate.

source: This means that you can continue to use already written code from MicroPython, but use less code space and RAM.
it_it: Ciò significa che è possibile continuare a utilizzare il codice già scritto in MicroPython, ma occupando meno spazio di codice e RAM.

source: This means that, with a single click in the Editor or with a CLI command, style properties from Figma can be downloaded and updated in the XML files.
it_it: Ciò significa che, con un solo clic nell'Editor o con un comando CLI, le proprietà di stile di Figma possono essere scaricate e aggiornate nei file XML.

source: This means the :ref:`flush_callback` callback only has to update the address of the frame buffer to the ``px_map`` parameter.
it_it: Ciò significa che la :ref:`flush_callback` deve solo aggiornare l'indirizzo del frame buffer al parametro ``px_map``.

source: This means you can use it even in commercial projects.
it_it: Questo significa che lo si può utilizzare anche in progetti commerciali.

source: This memory is used when you create Widgets like buttons, labels, etc.
it_it: Questa memoria viene utilizzata quando si creano widget come pulsanti, etichette, ecc.

source: This message means the Editor is downloading a pre-configured container image that includes all the necessary tools and dependencies for building LVGL projects.
it_it: Questo messaggio indica che l'editor sta scaricando un'immagine del container preconfigurata che include tutti gli strumenti e le dipendenze necessari per la creazione di progetti LVGL.

source: This method can effectively improve GPU utilization, especially in scenarios where rendering text, as the GPU's drawing time and the CPU's data preparation time are very close, allowing the CPU and GPU to run in parallel.
it_it: Questo metodo può migliorare efficacemente l'utilizzo della GPU, soprattutto in scenari in cui si esegue il rendering del testo, poiché il tempo di disegno della GPU e il tempo di preparazione dei dati della CPU sono molto simili, consentendo a CPU e GPU di funzionare in parallelo.

source: This method of subscribing to a Subject affects a Label Widget's ``text``.
it_it: Questo metodo di sottoscrizione a un Subject influisce sul ``text`` di un Widget Label.

source: This method of subscribing to a pointer Subject affects a Image Widget's source (``src``) value directly.
it_it: Questo metodo di sottoscrizione a un Subject puntatore influisce direttamente sul valore sorgente (``src``) di un Widget Image.

source: This method of subscribing to an integer Subject affects a Bar Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Bar.

source: This method of subscribing to an integer Subject affects a Drop-Down Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Drop-Down.

source: This method of subscribing to an integer Subject affects a Roller Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Roller.

source: This method of subscribing to an integer Subject affects a Section of a Scale Widget's integer minimum or maximum values directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sui valori minimi o massimi interi di una Sezione di un Widget "Scale".

source: This method of subscribing to an integer Subject affects a Slider Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Slider.

source: This method of subscribing to an integer Subject affects a Subject Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Subject.

source: This method of subscribing to an integer Subject affects an Arc Widget's integer value directly.
it_it: Questo metodo di sottoscrizione a un Subject intero influisce direttamente sul valore intero di un Widget Arc.

source: This method uses only a little extra RAM, as only the pointers to the strings are stored.
it_it: Questo metodo utilizza solo una piccola quantità di RAM aggiuntiva, poiché vengono memorizzati solo i puntatori alle stringhe.

source: This method will create a C file with two global variables called ``frogfs_bin`` and ``frogfs_bin_len`` which can be declared in other C files like:
it_it: Questo metodo creerà un file C con due variabili globali chiamate ``frogfs_bin`` e ``frogfs_bin_len`` che possono essere dichiarate in altri file C come:

source: This might be needed due to potential memory fragmentation.
it_it: Questo potrebbe essere necessario a causa della potenziale frammentazione della memoria.

source: This module is now deprecated and will be removed in an upcoming release.
it_it: Questo modulo è ora obsoleto e verrà rimosso in una prossima versione.

source: This module provides this service as simulated random input to stress test an LVGL application.
it_it: Questo modulo fornisce questo servizio come input casuale simulato per testare un'applicazione LVGL.

source: This must be done in the user-defined indev ``read_cb``.
it_it: Questa operazione deve essere eseguita nell'indev definito dall'utente ``read_cb``.

source: This necessitates a temporary drawing area (layer), often larger than the Widget proper, to provide an area of adequate size for the transformation.
it_it: Ciò richiede un'area di disegno temporanea (layer), spesso più grande del Widget vero e proprio, per fornire un'area di dimensioni adeguate alla trasformazione.

source: This needs to be disabled as the IDF doesn't play nice with dynamic linking.
it_it: Questa funzionalità deve essere disabilitata poiché l'IDF non funziona correttamente con il linking dinamico.

source: This needs to be done before making any other LVGL calls.
it_it: Questa operazione deve essere eseguita prima di qualsiasi altra chiamata a LVGL.

source: This next example assumes a Git repository.
it_it: Il prossimo esempio presuppone un repository Git.

source: This one will compile the application with performance as priority, using SIMD instructions where is possible.
it_it: Questa opzione compilerà l'applicazione dando priorità alle prestazioni, utilizzando istruzioni SIMD ove possibile.

source: This option can be disabled if the performance gain is not needed.
it_it: Questa opzione può essere disabilitata se non si desidera ottenere un miglioramento delle prestazioni.

source: This option instructs BitBake to try and continue processing the job as long as possible even after encountering an error.
it_it: Questa opzione indica a BitBake di provare a continuare l'elaborazione del job il più a lungo possibile anche dopo aver riscontrato un errore.

source: This option is disabled by default.
it_it: Questa opzione è disabilitata per default.

source: This panel is optional.
it_it: Questo pannello è facoltativo.

source: This peripheral is the 2-D direct memory access, or DMA2D, the Espressif SDK, the IDF, offers a full featured driver for the DMA2D that is automatically enabled on the supported chips.
it_it: Questa periferica è l'accesso diretto alla memoria 2D, o DMA2D; l'SDK Espressif, l'IDF, offre un driver completo per DMA2D che viene automaticamente abilitato sui chip supportati.

source: This places ``label`` 10 px above ``btn``.
it_it: Questo posiziona ``label`` 10 px sopra ``btn``.

source: This plugin can be found in the ``lvgl/scripts/gdb`` directory.
it_it: Questo plugin si trova nella directory ``lvgl/scripts/gdb``.

source: This pointer can be used later, e.g. in :ref:`display_events`.
it_it: Questo puntatore può essere utilizzato in seguito, ad esempio in :ref:`display_events`.

source: This project builds LVGL statically for customizability and to port the LVGL v9 benchmark from LVGL v8.3.
it_it: Questo progetto compila LVGL staticamente per la personalizzazione e per il porting del benchmark LVGL v9 da LVGL v8.3.

source: This project uses CMakePresets to ensure an easy build.
it_it: Questo progetto utilizza i preset CMake per garantire una build semplice.

source: This project uses D/AVE 2D rendering acceleration with LVGL's D/AVE 2D :ref:`draw unit<draw>`.
it_it: Questo progetto utilizza l'accelerazione di rendering 2D D/AVE con D/AVE 2D :ref:`draw unit<draw>` di LVGL.

source: This property affects the :ref:`screen load and create events <xml_events_screen>`.
it_it: Questa proprietà influenza gli :ref:`eventi di caricamento e creazione delle schermate <xml_events_screen>`.

source: This protects the long-term integrity and sustainability of the LVGL ecosystem by preventing unlicensed tools from reusing or replicating the Specification in ways that compete with official LVGL offerings.
it_it: Ciò protegge l'integrità e la sostenibilità a lungo termine dell'ecosistema LVGL impedendo a strumenti senza licenza di riutilizzare o replicare la Specifica in modi che competono con i prodotti LVGL ufficiali.

source: This prototype makes it easy to use most of the LVGL *set* functions directly or via a trivial wrapper.
it_it: Questo prototipo semplifica l'utilizzo della maggior parte delle funzioni *set* LVGL direttamente o tramite un wrapper banale.

source: This provides good visual quality for most use cases without any setup.
it_it: Questo fornisce una buona qualità visiva per la maggior parte dei casi d'uso senza alcuna configurazione.

source: This pseudocode illustrates the concept of using a MUTEX:
it_it: Questo pseudocodice illustra il concetto di utilizzo di un MUTEX:

source: This repository also has built-in FreeRTOS integration, making it easy to test the UI with an embedded OS as well.
it_it: Questo repository include anche l'integrazione con FreeRTOS, semplificando il test dell'interfaccia utente anche con un sistema operativo embedded.

source: This repository also has built-in FreeRTOS integration, making it easy to test the UI with an embedded OS.
it_it: Questo repository include anche l'integrazione con FreeRTOS, semplificando il test dell'interfaccia utente con un sistema operativo embedded.

source: This repository also includes built-in FreeRTOS integration, making it easy to test the UI with an embedded OS.
it_it: Questo repository include anche l'integrazione FreeRTOS integrata, semplificando il test dell'interfaccia utente con un sistema operativo embedded.

source: This requires making the children snappable and setting scroll snap alignment to something other than :cpp:enumerator:`LV_SCROLL_SNAP_NONE`.
it_it: Ciò richiede di rendere gli elementi figlio agganciabili e di impostare l'allineamento dello snap dello scorrimento su un valore diverso da :cpp:enumerator:`LV_SCROLL_SNAP_NONE`.

source: This requires python3 with ``venv`` and ``pip`` or access to a working ``pcpp``.
it_it: Questo richiede python3 con ``venv`` e ``pip`` o l'accesso a un ``pcpp`` funzionante.

source: This requires the Image Button's :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` flag to be set.
it_it: Richiede l'impostazione del flag :cpp:enumerator:`LV_OBJ_FLAG_CHECKABLE` dell'Image Button.

source: This saves only a little bit of memory.
it_it: Questo consente di risparmiare solo una piccola quantità di memoria.

source: This script allows you to install the SDK where you prefer.
it_it: Questo script consente di installare l'SDK dove si preferisce.

source: This section briefly introduces BitBake.
it_it: Questa sezione introduce brevemente BitBake.

source: This section covers a lot of variables used in the OpenEmbedded build system.
it_it: Questa sezione tratta molte variabili utilizzate nel sistema di build OpenEmbedded.

source: This section describes special cases where LVGL's behavior might be unexpected.
it_it: Questa sezione descrive casi speciali in cui il comportamento di LVGL potrebbe essere inaspettato.

source: This section objective is to ease to process of understanding the basic concepts of Yocto and to help beginners to start with Yocto.
it_it: L'obiettivo di questa sezione è facilitare la comprensione dei concetti di base di Yocto e aiutare i principianti a iniziare a utilizzarlo.

source: This section of LVGL documentation is about the latter: it describes how to use the LVGL images module to draw images (in various forms) to a Display.
it_it: Questa sezione della documentazione LVGL riguarda quest'ultimo aspetto: descrive come utilizzare il modulo immagini LVGL per disegnare immagini (in varie forme) su un display.
